app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 3, 5)
---
  def index
    ids = user_params[:ids] ? user_params[:ids].split(',').map(&:to_i) : nil
    @users = ids ? User.where(id: ids).index_by(&:id).slice(*ids).values : User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? AND "users"."name" = ? AND "users"."email" = ? LIMIT ?  [["id", 1], ["name", "admin"], ["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def search
    name = user_params[:name] ? user_params[:name].downcase : ' '
    email = user_params[:email] ? user_params[:email].downcase : ' '
    @users = User.where("lower(name) LIKE ? OR lower(email) LIKE ?", "%#{name}%", "%#{email}%").map{|x| x.as_json}

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "gabo"], ["email", "yeah@yeah.com"], ["created_at", 2017-04-14 18:47:57 UTC], ["updated_at", 2017-04-14 18:47:57 UTC]]
---
  def create
    @user = User.create!(user_params)

UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Exeggcute2"], ["email", "lacey@sanfordspencer.nett"], ["updated_at", 2017-04-29 00:01:26 UTC], ["id", 1]]
---
  def update
    @user.update(user_params)